# Creating a Series
Creating a Series by passing a list of values, letting pandas create a default integer index:

In [2]:
import pandas as pd
import numpy as np

s = pd.Series([1, 3, 5, np.nan, 6, 7,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    7.0
6    8.0
dtype: float64

Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns

In [3]:
dates = pd.date_range("20120601", periods=5)
dates

DatetimeIndex(['2012-06-01', '2012-06-02', '2012-06-03', '2012-06-04',
               '2012-06-05'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(5, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2012-06-01 -1.028903  0.338314  1.344777 -1.457014
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449
2012-06-03 -0.390865 -0.756674  1.878731  0.728453
2012-06-04  0.239447 -1.155957  0.475571 -0.034609
2012-06-05  0.595104 -1.080424  0.873616  1.138384

In [5]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

Creating a DataFrame by passing a dictionary of objects that can be converted into a series-like structure

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220601"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2022-06-01  1.0  3   test  foo
1  1.0 2022-06-01  1.0  3  train  foo
2  1.0 2022-06-01  1.0  3   test  foo
3  1.0 2022-06-01  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data
Display the index, columns:

In [8]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [9]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

NumPy representation of the underlying data

In [10]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2022-06-01 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2022-06-01 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2022-06-01 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

To show a quick statistic summary of your data

In [11]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

Transposing your data

In [12]:
df.T

   2012-06-01  2012-06-02  2012-06-03  2012-06-04  2012-06-05
A   -1.028903   -0.297626   -0.390865    0.239447    0.595104
B    0.338314    0.398681   -0.756674   -1.155957   -1.080424
C    1.344777   -0.584932    1.878731    0.475571    0.873616
D   -1.457014   -0.464449    0.728453   -0.034609    1.138384

Sorting by an axis

In [13]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2012-06-01 -1.457014  1.344777  0.338314 -1.028903
2012-06-02 -0.464449 -0.584932  0.398681 -0.297626
2012-06-03  0.728453  1.878731 -0.756674 -0.390865
2012-06-04 -0.034609  0.475571 -1.155957  0.239447
2012-06-05  1.138384  0.873616 -1.080424  0.595104

Sorting by values

In [14]:
df.sort_values(by="D")

                   A         B         C         D
2012-06-01 -1.028903  0.338314  1.344777 -1.457014
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449
2012-06-04  0.239447 -1.155957  0.475571 -0.034609
2012-06-03 -0.390865 -0.756674  1.878731  0.728453
2012-06-05  0.595104 -1.080424  0.873616  1.138384

# Selection
select a single column

In [15]:
df["B"]

2012-06-01    0.338314
2012-06-02    0.398681
2012-06-03   -0.756674
2012-06-04   -1.155957
2012-06-05   -1.080424
Freq: D, Name: B, dtype: float64

Selecting via [], which slices the rows

In [16]:
df[0:2]

                   A         B         C         D
2012-06-01 -1.028903  0.338314  1.344777 -1.457014
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449

In [17]:
df["20120602":"20120604"]

                   A         B         C         D
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449
2012-06-03 -0.390865 -0.756674  1.878731  0.728453
2012-06-04  0.239447 -1.155957  0.475571 -0.034609

Selection by label

In [18]:
df.loc[dates[1]]

A   -0.297626
B    0.398681
C   -0.584932
D   -0.464449
Name: 2012-06-02 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [19]:
df.loc[:, ["C", "D"]]

                   C         D
2012-06-01  1.344777 -1.457014
2012-06-02 -0.584932 -0.464449
2012-06-03  1.878731  0.728453
2012-06-04  0.475571 -0.034609
2012-06-05  0.873616  1.138384

Showing label slicing, both endpoints are included

In [20]:
df.loc["20120602":"20120604", ["A", "B"]]

                   A         B
2012-06-02 -0.297626  0.398681
2012-06-03 -0.390865 -0.756674
2012-06-04  0.239447 -1.155957

Reduction in the dimensions of the returned object

In [21]:
df.loc["20120603", ["A", "B"]]

A   -0.390865
B   -0.756674
Name: 2012-06-03 00:00:00, dtype: float64

For getting a scalar value

In [22]:
df.loc[dates[3], "A"]

0.23944689729172222

For getting fast access to a scalar (equivalent to the prior method)

In [23]:
df.at[dates[3], "A"]

0.23944689729172222

Selection by position

In [24]:
df.iloc[3]

A    0.239447
B   -1.155957
C    0.475571
D   -0.034609
Name: 2012-06-04 00:00:00, dtype: float64

For slicing rows explicitly

In [25]:
df.iloc[1:4, :]

                   A         B         C         D
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449
2012-06-03 -0.390865 -0.756674  1.878731  0.728453
2012-06-04  0.239447 -1.155957  0.475571 -0.034609

For slicing columns explicitly

In [26]:
df.iloc[:, 1:3]

                   B         C
2012-06-01  0.338314  1.344777
2012-06-02  0.398681 -0.584932
2012-06-03 -0.756674  1.878731
2012-06-04 -1.155957  0.475571
2012-06-05 -1.080424  0.873616

For getting a value explicitly

In [27]:
df.iloc[2, 2]

1.8787305452796665

For getting fast access to a scalar

In [28]:
df.iat[2, 2]

1.8787305452796665

Using a single columnâ€™s values to select data

In [29]:
df[df["A"] > 0]

                   A         B         C         D
2012-06-04  0.239447 -1.155957  0.475571 -0.034609
2012-06-05  0.595104 -1.080424  0.873616  1.138384

Selecting values from a DataFrame where a boolean condition is met

In [32]:
df[df > 0]

                   A         B         C         D
2012-06-01       NaN  0.338314  1.344777       NaN
2012-06-02       NaN  0.398681       NaN       NaN
2012-06-03       NaN       NaN  1.878731  0.728453
2012-06-04  0.239447       NaN  0.475571       NaN
2012-06-05  0.595104       NaN  0.873616  1.138384

Using the isin() method for filtering

In [52]:
df4 = df.copy()
df4["E"] = ["one", "one", "two", "three", "four"]
df4

                   A         B         C         D      E
2012-06-01 -1.028903  0.338314  1.344777 -1.457014    one
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449    one
2012-06-03 -0.390865 -0.756674  1.878731  0.728453    two
2012-06-04  0.239447 -1.155957  0.475571 -0.034609  three
2012-06-05  0.595104 -1.080424  0.873616  1.138384   four

In [53]:
df4[df4["E"].isin(["two", "four"])]

                   A         B         C         D     E
2012-06-03 -0.390865 -0.756674  1.878731  0.728453   two
2012-06-05  0.595104 -1.080424  0.873616  1.138384  four

Setting a new column automatically aligns the data by the indexes

In [59]:
s1 = pd.Series([1, 2, 3, 4, 5], index=pd.date_range("20130101", periods=5))
s1

2013-01-01    1
2013-01-02    2
2013-01-03    3
2013-01-04    4
2013-01-05    5
Freq: D, dtype: int64

# Missing data

In [62]:
df5 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df5.loc[dates[0] : dates[1], "E"] = 1
df5

                   A         B         C         D    E
2012-06-01 -1.028903  0.338314  1.344777 -1.457014  1.0
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449  1.0
2012-06-03 -0.390865 -0.756674  1.878731  0.728453  NaN
2012-06-04  0.239447 -1.155957  0.475571 -0.034609  NaN

To drop any rows that have missing data

In [63]:
df5.dropna(how="any")

                   A         B         C         D    E
2012-06-01 -1.028903  0.338314  1.344777 -1.457014  1.0
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449  1.0

Filling missing data

In [64]:
df5.fillna(value=5)

                   A         B         C         D    E
2012-06-01 -1.028903  0.338314  1.344777 -1.457014  1.0
2012-06-02 -0.297626  0.398681 -0.584932 -0.464449  1.0
2012-06-03 -0.390865 -0.756674  1.878731  0.728453  5.0
2012-06-04  0.239447 -1.155957  0.475571 -0.034609  5.0

To get the boolean mask where values are nan

In [66]:
pd.isna(df5)

                A      B      C      D      E
2012-06-01  False  False  False  False  False
2012-06-02  False  False  False  False  False
2012-06-03  False  False  False  False   True
2012-06-04  False  False  False  False   True

# Operations
Performing a descriptive statistic

In [67]:
df5.mean()

A   -0.369487
B   -0.293909
C    0.778537
D   -0.306905
E    1.000000
dtype: float64

Same operation on the other axis

In [68]:
df5.mean(1)

2012-06-01    0.039435
2012-06-02    0.010335
2012-06-03    0.364911
2012-06-04   -0.118887
Freq: D, dtype: float64

String Methods

In [70]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge
Concatenating pandas objects together with concat()

In [72]:
df6 = pd.DataFrame(np.random.randn(10, 4))
df6

          0         1         2         3
0 -0.869506 -1.782984  0.232330 -0.207080
1  0.053375  1.348375 -0.121124 -1.541468
2  0.164263  0.005158 -1.083703  0.388491
3 -1.582100 -0.111732  1.909331  0.618492
4 -0.180256 -1.121533  1.478441  0.895210
5  0.968308 -0.909204  0.425810 -0.741531
6 -0.650651  0.017990  0.524357  0.610745
7  0.595104  1.699543 -2.131028  0.540172
8 -0.705170  0.498400 -1.155763  0.703095
9 -1.089940 -1.469355 -0.655404 -0.055511

In [75]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.344089 -0.133591  0.765013  1.206866
 1 -1.332358  0.807920  0.170558  0.309427
 2 -0.106866  0.631377  0.418067  2.640677,
           0         1         2         3
 3  1.109673  0.250992 -0.093698 -1.426727
 4  0.074193 -0.400502 -1.992831  0.122591
 5 -0.986734  0.396807  1.794337  0.427889
 6  0.162191 -0.969964  2.118185  0.310057,
           0         1         2         3
 7  0.257039 -1.347275  1.107832 -0.196464
 8 -1.220173 -0.090590 -0.273092  1.052078
 9  0.403222  0.220899  1.037947 -0.591934]

In [76]:
pd.concat(pieces)

          0         1         2         3
0 -0.344089 -0.133591  0.765013  1.206866
1 -1.332358  0.807920  0.170558  0.309427
2 -0.106866  0.631377  0.418067  2.640677
3  1.109673  0.250992 -0.093698 -1.426727
4  0.074193 -0.400502 -1.992831  0.122591
5 -0.986734  0.396807  1.794337  0.427889
6  0.162191 -0.969964  2.118185  0.310057
7  0.257039 -1.347275  1.107832 -0.196464
8 -1.220173 -0.090590 -0.273092  1.052078
9  0.403222  0.220899  1.037947 -0.591934

Join

In [77]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [78]:
right

   key  rval
0  foo     4
1  foo     5

In [79]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [80]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [81]:
right

   key  rval
0  foo     4
1  bar     5

In [82]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Grouping

In [83]:
df7 = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df7

     A      B         C         D
0  foo    one -0.737335  0.220598
1  bar    one  0.563494 -1.188900
2  foo    two -0.181479 -1.331060
3  bar  three -1.459665  0.616372
4  foo    two -0.710531  1.057168
5  bar    two  1.569304 -0.045331
6  foo    one -1.817473 -0.292323
7  foo  three -0.688769 -1.073099

Grouping and then applying the sum() function to the resulting groups

In [84]:
df7.groupby("A").sum()

            C         D
A
bar  0.673133 -0.617859
foo -4.135586 -1.418716

Grouping by multiple columns forms a hierarchical index, and again we can apply the sum() function

In [85]:
df7.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one    0.563494 -1.188900
    three -1.459665  0.616372
    two    1.569304 -0.045331
foo one   -2.554808 -0.071725
    three -0.688769 -1.073099
    two   -0.892010 -0.273892